# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, 
# а некоторые – гербом. Определите минимальное число монеток, которые нужно
# перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной.
# Выведите минимальное количество монет, которые нужно перевернуть.
# польз вводит числос ам через фор

number = int(input('Введите число монеток: '))
side_1 = 0
side_2 = 0

for 
coins_min_num
print(coins_min_num)